compressible/rhoPimpleFoam/laminar/hydroacousticWaveTrain/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    "(rho|rhoFinal)"
    {
        solver          diagonal;
    }

    
    "(p|Phi)"
    {
        solver          PCG;
        preconditioner  FDIC;
        tolerance       1e-20;
        relTol          0.05;
        maxIter         600;
    }

    pFinal
    {
        $p;
        tolerance       1e-08;
        relTol          0.0;
    }

    "(U|k|omega|nuTilda)"
    {
//        solver          smoothSolver;
//        smoother        symGaussSeidel;
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-20;
        relTol          0.1;
    }

    "(U|k|omega|nuTilda)Final"
    {
        $U;
        tolerance       1e-20;
        relTol          0.1;
    }

    "(h|e|hFinal|eFinal)"
    {
        $U;
        tolerance       1.0e-020;
        relTol          0.1;
    }
}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors  7;
    nCorrectors       2;
//  rhoMax            1100;
    pMaxFactor        1.2;
    pMinFactor        0.8;
}

relaxationFactors
{
        U               0.8;
        p               0.8;
        h               0.9;
        e               0.9;
        k               0.8;
        nuTilda         0.8;
        omega           0.8;
        pFinal          1.0;
        UFinal          1.0;
        hTFinal         1.0;
        eTFinal         1.0;
        kFinal          1.0;
        omegaFinal      1.0;
        nuTildaFinal    1.0;
}

// ************************************************************************* //
